{"data":{"site":{"siteMetadata":{"title":"Knowit Academy Norway","siteUrl":"https://academy.knowit.no","description":"Knowit Academy Norway er Knowits kompetanseutviklingsprogram for ansatte i alle norske enheter. Planleggingen av programmet for 2019-2020 er i gang, og mer informasjon vil bli lagt ut så snart det er klart.","ogImage":"https://academy.knowit.no/assets/knowit_academy_banner_green.png"}},"allMarkdownRemark":{"edges":[{"node":{"html":"<h1>Om Knowit Academy</h1>\n<p>Knowit Academy Norway er Knowits interne kompetanseutviklingsprogram.\nMålgruppen for programmet er alle ansatte i Knowits selskaper i Norge. Vår\nambisjon er å lage det beste og mest givende kompetanseutviklingsprogramet man\nkan finne i teknologibedrifter.</p>\n<p>Med oppstart høsten 2019 planlegger vi å gjennomføre programmer for\ntech-leads, team-leads og designere.</p>\n<p>Vi har også et program for rådgivning og ledelse vi jobber med å gjennomføre med\noppstart høsten 2020.</p>","frontmatter":{"title":"About Knowit Academy","path":"/about","date":"2019-06-05","endDate":null,"description":"Knowit Academy er knowits interne utviklingsprogram. Programmet har som ambisjon om å være det beste og mest givende kompentaseutviklingsprogrammet.","image":null,"teacher":null,"updated":"2019-06-05","confirmed":null,"author":null,"location":null}}},{"node":{"html":"<p>Programmene i Knowit Academy er åpent for alle ansatte i Knowit. I tillegg gir\nvi noen plasser til prioriterte kunder. Det er ønskelig at du avklarer\nsøknaden til Knowit Academy med nærmeste leder, fordi programmet er såpass\nomfattende.</p>\n<p>Søknadsfrist er <strong>mandag 2. september, 2019</strong></p>\n<p>Deltagelse på alle kurs i et program er obligatorisk. Dersom du ikke kan møte\nmå du ha en gyldig fraværsgrunn. Du kan føre timer for kursene som går på\ndagtid, kveldskursene går på egentid.</p>\n<iframe src=\"https://docs.google.com/forms/d/e/1FAIpQLScnKOwzhu_1hf6l_2UtIrWJC2OJ0xWa4C0VhhyMui8mwD0D2Q/viewform?embedded=true\" \n  style=\"width: 100%; padding: 24px 0; height: 1800px\" \n  frameborder=\"0\" marginheight=\"0\" marginwidth=\"0\">\nLoading…\n</iframe>","frontmatter":{"title":"Søknadsskjema til Knowit Academy","path":"/application-form","date":"2019-08-14 10:00","endDate":null,"description":"Application form in Norwegian to Knowit Academy","image":null,"teacher":null,"updated":"2019-08-14","confirmed":null,"author":"Thomas Malt","location":null}}},{"node":{"html":"<p>Det er mange som vil delta på programmene i Knowit Academy og stor konkurranse\nom plassene. Her kommer mer informasjon om søknadsprosessen og hvordan du går\nfram for å søke.</p>\n<h2>Avklar med nærmeste leder</h2>\n<p>Avklar med din nærmeste leder at du ønsker å søke på programmet. Hun eller han\nvil også kunne fortelle deg mer om søknadsprosessen.</p>\n<h2>Skriv et søknadsbrev</h2>\n<p>Vi ønsker skriftlige søknader fra alle som ønsker å delta. Fortell oss hvem du\ner, hvorfor du ønsker å søke og hva du håper å benytte det du lærer til.</p>\n<h2>Send inn søknad</h2>\n<p>Husk å <a href=\"/application-form\">sende inn søknad</a> innen fristen.\nPåmeldingen er åpen, og fristen i år er <b>mandag 2. september.</b></p>","frontmatter":{"title":"Informasjon om søknadsprosessen til Knowit Academy","path":"/how-to-apply","date":"2019-06-05","endDate":null,"description":"Information in Norwegian about the application process for Knowit Academy","image":null,"teacher":null,"updated":"2019-08-15","confirmed":null,"author":"Thomas Malt","location":null}}},{"node":{"html":"<p>Program for design- og innovasjonsledelse (primært for digitale prosjekter).\nMålet er å videreutdanne eksperter som styrker den faglige kvaliteten i\nprosjektene våre og i det interne miljøet i Knowit.</p>\n<p>Design-leads leder og fasiliterer komplekse designprosesser, setter retning i\nprosjektene, jobber tverrfaglig med å utvikle designkonsepter og har ansvar\nfor faglig kvalitet i leveransene.</p>\n<p>Kurset vil omhandle temaer som kommunikasjon, metodikk, prosjekt- og\ndesignledelse, innsikt og analyse, fasilitering, digital strategi og\ninnovasjon.</p>","frontmatter":{"title":"Design-lead programmet","path":"/programs/about-design-lead","date":"2019-06-05","endDate":null,"description":"For designere med minst 2 års erfaring som vil utvikle seg videre for å ta større ansvar i leveranser, strategiarbeid og kreativ ledelse.","image":null,"teacher":null,"updated":"2019-06-24","confirmed":null,"author":"Thea Basthus Nilsen","location":null}}},{"node":{"html":"<p>Dette er skolen for deg som vil lære hvordan du best leder en workshop,\nhvordan håndtere prosjektene dine i Jira/Confluence, hvordan endre\norganisasjoner gjennom Change Management, bli mer effektiv med bruk av Excel,\nvinne fram i salgsprosesser i pitchekurset, endre måten din å tenke på i\nGoogle Design Sprint, motivere medarbeiderne dine gjennnom \"Ledelse i\nprosjekter\", hvor du også lærer å bygge gode prosjektteam og unngå tidstyver.\nDet er rom for diskusjon og mulighet til å diskutere dine ledererfaringer med\nandre kollega og kursleder.</p>\n<h2>Påmelding</h2>\n<p>Dette programmet utsettes ett år. Vi har undersøkt og det er ikke mange nok interesserte enda (trenger 20). Påmelding til programmet åpnes i midten av august neste år, og fristen for påmelding blir da 31. august, 2020.</p>\n<h2>Mer informasjon</h2>\n<p>Du kan kontakte Heidi Hundåla inntil videre,\n<a href=\"mailto:heidi.hundala@knowit.no\">heidi.hundala@knowit.no</a> for flere\ndetaljer om programmet. Det kommer mer informasjon om neste års program så snart\ndet er klart.</p>","frontmatter":{"title":"Programmet for rådgivning og ledelse","path":"/programs/about-radgivning-og-ledelse","date":"2019-06-12","endDate":null,"description":"For deg som vil lære hvordan du best leder en workshop, hvordan endre organisasjoner gjennom Change Management, og mye mer.","image":null,"teacher":null,"updated":"2019-06-12","confirmed":null,"author":"Heidi Hundåla","location":null}}},{"node":{"html":"<p>Dette er skolen for deg som vil lære hvordan du best leder en workshop,\nhvordan håndtere prosjektene dine i Jira/Confluence, hvordan endre\norganisasjoner gjennom Change Management, bli mer effektiv med bruk av Excel,\nvinne fram i salgsprosesser i pitchekurset, endre måten din å tenke på i\nGoogle Design Sprint, motivere medarbeiderne dine gjennnom \"Ledelse i\nprosjekter\", hvor du også lærer å bygge gode prosjektteam og unngå tidstyver.\nDet er rom for diskusjon og mulighet til å diskutere dine ledererfaringer med\nandre kollega og kursleder.</p>\n<h2>Påmelding</h2>\n<p>Dette programmet utsettes ett år. Vi har undersøkt og det er ikke mange nok interesserte enda (trenger 20). Påmelding til programmet åpnes i midten av august neste år, og fristen for påmelding blir da 31. august, 2020.</p>\n<h2>Mer informasjon</h2>\n<p>Du kan kontakte Heidi Hundåla inntil videre,\n<a href=\"mailto:heidi.hundala@knowit.no\">heidi.hundala@knowit.no</a> for flere\ndetaljer om programmet. Det kommer mer informasjon om neste års program så snart</p>","frontmatter":{"title":"Programmet for rådgivning og ledelse","path":"/programs/radgivning-og-ledelse","date":"2019-06-12","endDate":null,"description":"For deg som vil lære hvordan du best leder en workshop, hvordan endre organisasjoner gjennom Change Management, og mye mer.","image":null,"teacher":null,"updated":"2019-06-12","confirmed":null,"author":"Heidi Hundåla","location":null}}},{"node":{"html":"<p>Team-lead programmet er for deg med minst 3 års erfaring fra systemutvikling, og som\nønsker å ta en faglig lederrolle, samt utvikle og følge opp et teknisk team.</p>","frontmatter":{"title":"Team-lead programmet","path":"/programs/about-team-lead","date":"2019-04-27","endDate":null,"description":"For deg med minst 3 års erfaring fra systemutvikling, og som ønsker å ta en faglig lederrolle, samt utvikle og følge opp et teknisk team.","image":null,"teacher":null,"updated":"2019-07-05","confirmed":null,"author":"Thomas Malt","location":null}}},{"node":{"html":"<p>Tech-Lead programmet er for deg med minst 2 års utviklererfaring, som vil\nutvikle deg videre som tech-lead og arkitekt på et utviklingsteam.</p>\n<p>Programmet starter i september 2019 og varer fram til sommeren 2020.\nHer finner du mer informasjon om programmet, hvilke kurs og workshops som er med,\nog informasjon om hvordan du søker.</p>","frontmatter":{"title":"Tech-lead programmet","path":"/programs/about-tech-lead","date":"2019-04-27","endDate":null,"description":"For deg med minst 2 års utviklererfaring, som vil utvikle deg videre som tech-lead og arkitekt på et utviklingsteam. Programmet starter i september 2019 og varer fram til sommeren 2020.","image":"","teacher":null,"updated":"2019-06-19","confirmed":null,"author":"Thomas Malt","location":null}}},{"node":{"html":"<p>Hvordan kan du som designer jobbe mer strategisk og være en god rådgiver innen strategiske beslutninger.</p>\n<h1>Dette lærer du</h1>\n<ul>\n<li>Holde en innledende workshop med oppdragsgiver som også kan brukes som innsalg, og veien videre til strategisk workshop.</li>\n<li>Hvordan forstå virksomheten, deres univers og hvilke faktorer som påvirker dem?</li>\n<li>Hvordan skal vi tenke, utvikle og bruke mål og strategi? Hvilke strategier trenger vi egentlig?</li>\n<li>Hva er Designstrategi vs. Designbrief?</li>\n<li>Hvordan koble strategi og design?</li>\n</ul>\n<h1>Wanda Grimsgaard</h1>\n<p>Wanda Grimsgaard er professor i visuell kommunikasjon ved Universitetet i Sør-øst-Norge, med strategisk utvikling av design som spesialkompetanse. September 2018 publiserte hun boken Design og strategi hos Cappelen Damm Akademisk. Hun har mange års erfaring fra designbransjen som designer og gjennom drift av designbyrå, både i partnerskap med andre og i egen regi. Kjernevirksomheten har vært utvikling av identiteter for virksomheter, produkter eller tjenester, der formålet har vært å øke kjennskap og konkurransekraft. Kundene har vært alt fra nyetableringer og mellomstore bedrifter, til store, kjente merkebedrifter. Wanda har i en årrekke også vært sensor, foreleser og kursholder for ulike kursarrangører og designskoler.</p>","frontmatter":{"title":"Design- og innovasjonsstrategi","path":"/courses/design-lead/design-og-innovasjonsstrategi","date":"2020-04-06","endDate":null,"description":"Hvordan kan du som designer jobbe mer strategisk og være en god rådgiver innen strategiske beslutninger.","image":"/assets/Wanda_Grimsgard.jpg","teacher":"Wanda Grimsgaard","updated":"2019-06-24","confirmed":null,"author":"Thea Basthus Nilsen","location":null}}},{"node":{"html":"<p><strong>NB: Tentativ dato (ikke fastsatt)</strong></p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>Planlegging av designprosesser, arbeid med salg og forståelse for kontrakter og avtaler</li>\n<li>Hvordan du kan omsette visjon til gjennomføring og skaper et miljø for samarbeid og høy faglig kvalitet</li>\n<li>Forståelse og styring av risiko og avhengigheter på tvers av folk, fagfelt og ansvarsområder</li>\n<li>Forstå og løse faglige og tekniske utfordringer av ulik grad av kompleksitet og risiko</li>\n</ul>\n<h1>Om kursholder</h1>\n<p>TBA</p>","frontmatter":{"title":"Designledelse","path":"/courses/design-lead/designledelse","date":"2020-02-10","endDate":null,"description":"","image":"/assets/knowit_academy_favicon_white.png","teacher":"TBA","updated":"2019-06-24","confirmed":null,"author":"Thea Basthus Nilsen","location":null}}},{"node":{"html":"<p>Første del av 2 sesjoner hvor vi går i dybden og lærer praktisk om ulike aktuelle design- og innovasjonsmetodikker. I denne sesjonen fokuserer vi på lean-metodikk.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>Prinsipper for å mestre lean og kontinuerlig innovasjon</li>\n<li>Verktøy for lean UX i praksis</li>\n<li>Hvordan du kontinuerlig engasjerer brukerne og avdekker hva du skal utvikles</li>\n</ul>\n<h1>Om kursholder</h1>\n<p>TBA</p>","frontmatter":{"title":"Innovasjon- og designmetodikk del 1","path":"/courses/design-lead/innovasjon-og-designmetodikk-1","date":"2019-09-26 12:00","endDate":null,"description":"Første del av 2 sesjoner hvor vi går i dybden og lærer praktisk om ulike aktuelle design- og innovasjonsmetodikker. I denne sesjonen fokuserer vi på lean-metodikk.","image":"/assets/knowit_academy_favicon_white.png","teacher":"TBA","updated":"2019-08-23","confirmed":true,"author":"Thea Basthus Nilsen","location":"IBM Client Center - Super Moon, Oslo"}}},{"node":{"html":"<p>Kurset vil foregå på engelsk:</p>\n<p>Design thinking is a practical, human-centered, and prototype-driven methodology for innovation. It helps teams of diverse people tackle fuzzy, ill-defined challenges in creative ways. These challenges can come in many shapes and sizes, for example, the development of new products, services, and experiences; the design of business models; or the shaping of organizational culture. </p>\n<h1>You will learn</h1>\n<ul>\n<li>Put yourself in the shoes of others and adopt an empathic perspective by observing and immersing</li>\n<li>Interview people in order to elicit meaningful responses that point you towards their deepest intentions</li>\n<li>Make sense of your empathy research by crafting powerful insights, and move from data to knowledge</li>\n<li>Craft a strong Point of View, which will synthesize your empathy research and give it focus and direction</li>\n<li>Become skilled at coming up with creative ideas that will serve as solutions to complex, ambiguous challenges</li>\n<li>Use many different ideation tools like brainstorming, brainwriting, and quick sketching</li>\n<li>Build all sorts of rapid and rough prototypes that bring your ideas into the real world quickly and cheaply</li>\n<li>Expose prototypes to the world, ask the right questions, receive good feedback, learn, and iterate repeatedly</li>\n<li>Collaborate with people with different backgrounds, and tap into the creative potential of diversity</li>\n<li>Play, have fun, laugh, and not take yourself too seriously while taking your creative work extremely seriously</li>\n</ul>\n<h1>Federico Lozano</h1>\n<p>Fede is the founder of Pracademy, an innovation training firm based in Norway with clients in dozens of countries, and Asst. Professor II of Innovation at the Norwegian University of Science &#x26; Technology, where he was awarded the Best Teacher of the Year Prize. Fede also teaches in various courses at the Norwegian School of Economics, and is the co-founder of the Lab for Design Thinkers at UiT The Arctic University of Norway, where he was also named Teacher of the Year. Further, along with his colleagues at Design Region Bergen, he launched the first design thinking executive-education program in Norway.  Fede earned his MBA at Stanford where he was awarded the Stanford Social Innovation Fellowship, which served as seed funding for Puentes Global, a social enterprise he co-founded in Madrid. He was also one of the first hires at d.light, one of the world's fastest-growing social enterprises, which is based in India and was spun out of the Stanford d.school.</p>","frontmatter":{"title":"Innovasjon- og designmetodikk: Design Thinking","path":"/courses/design-lead/innovasjon-og-designmetodikk-2","date":"2020-01-29 kl 09:00","endDate":null,"description":"Design thinking er en praktisk, menneskesentrert og prototyp-drevet metodikk for innovasjon. Det hjelper sammensatte og tverrfaglige team å takle uklare og udefinerte utfordringer på kreative måter. I denne workshoppen vil du lære verktøy og tankesettet sentralt i design thinking.","image":"/assets/knowit_academy_favicon_white.png","teacher":"Federico Lozano","updated":"2019-06-24","confirmed":true,"author":"Thea Basthus Nilsen","location":null}}},{"node":{"html":"<p><strong>NB: Tentativ dato (ikke fastsatt)</strong></p>\n<p>Hvordan kan vi sikre at vi alltid setter brukeren først og hvordan går vi frem for å få god innsikt i brukernes behov? I denne sesjonen får vi trening i innsikt- og analysearbeidet som er avgjørende for å skape innovative og brukervennlige løsninger.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>Metoder og verktøy for å forstå brukerne, identifisere hvem de er og deres behov </li>\n<li>Hvordan du oversetter innsikt til løsninger og konsepter som møter brukerens behov</li>\n<li>Visualisering av innsikt og prototyping av løsninger</li>\n<li>Om kvantitativ innsikt</li>\n</ul>\n<h1>Om læreren</h1>\n<p>TBA</p>","frontmatter":{"title":"Innsikt og analyse","path":"/courses/design-lead/innsikt-og-analyse","date":"2020-03-02","endDate":null,"description":"Hvordan kan vi sikre at vi alltid setter brukeren først og hvordan går vi frem for å få god innsikt i brukernes behov? I denne sesjonen får vi trening i innsikt- og analysearbeidet som er avgjørende for å skape innovative og brukervennlige løsninger.","image":"/assets/knowit_academy_favicon_white.png","teacher":"TBA","updated":"2019-06-24","confirmed":null,"author":"Thea Basthus Nilsen","location":null}}},{"node":{"html":"<p>Hvordan jobbe effektivt med arkitektur og teknologi. Hvilke behov har utviklere og arkitekter når de skal jobbe effektivt med design og brukeropplevelse. Hvordan kan vi bygge opp og organisere høyeffektive produkt- og tjenesteutviklingsteam. I workshoppen vil vi gå gjennom hvordan skape grunnlag for god samarbeidskultur, og hvordan tjenestedesign og brukeropplevelse er en sentral del av ethvert velfungerende utviklingsteam.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>Overordnet kunnskap om teknologiprosesser og metodikk</li>\n<li>Verktøy for samarbeid i produkt- og tjenesteutviklingsteam</li>\n<li>Å ta gode beslutninger basert på teknologisk</li>\n</ul>\n<h1>Om Thomas Malt</h1>\n<p>Principal Engineer i Knowit. Thomas er virksomhetsarkitekt, løsningsarkitekt\nog tidligere Full Stack utvikler som fremdeles holder seg oppdatert på\nprogrammeringsspråk og teknologi. Han er en leder med entreprenøregenskaper og\nerfaring fra transformasjonsledelse.</p>\n<p>Thomas har mange års erfaring som teknologidirektør, utviklingssjef og\navdelingssleder, og før det lang erfaring med systemutvikling med ansvar i\nspennet fra utviklingsledelse til arkitektur og prosjektledelse.</p>\n<p>Blant mye annet er han opptatt av effektiv bruk av smidig metodikk og\nviktigheten av å legge til rette for kontinuerlig læring. Videre er han\nopptatt av å bidra til å bygge opp team basert på sosial trygghet, der teamene\nbåde får mulighet og myndighet til å ta helhetlig ansvar for løsningene som\nskal utvikles.</p>","frontmatter":{"title":"Intro til teknologiprosesser og metodikk","path":"/courses/design-lead/intro-til-tech","date":"2020-04-23 16:00","endDate":null,"description":"Hvordan jobbe effektivt med arkitektur og teknologi. Hvilke behov har utviklere og arkitekter når de skal jobbe effektivt med design og brukeropplevelse. Hvordan kan vi bygge opp og organisere høyeffektive produkt- og tjenesteutviklingsteam. I workshoppen vil vi gå gjennom hvordan skape grunnlag for god samarbeidskultur, og hvordan tjenestedesign og brukeropplevelse er en sentral del av ethvert velfungerende utviklingsteam.","image":"/assets/thomas_malt.jpg","teacher":"Thomas Malt","updated":"2019-08-21","confirmed":true,"author":"Thea Basthus Nilsen","location":"Midten, Oslo"}}},{"node":{"html":"<p>Kick-off'en er starten på design-lead-programmet.\nHer vil du få vite detaljert om hva som skal skje gjennom året, hva du kan forvente av programmet og hva som er forventet av deg som deltager.\nDu vil også få muligheten til å bli bedre kjent med de andre deltagerne og designfeltene.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>Informasjon om årets program, deltagere og arrangører </li>\n<li>Praktisk gjennomføring av programmet og forventninger til kursdeltagere</li>\n<li>Eventuelle spørsmål</li>\n<li>Og en hemmelig aktivitet og middag for å bli bedre kjent!</li>\n</ul>\n<h1>Om kursholder</h1>\n<p>TBA</p>","frontmatter":{"title":"Kick-off","path":"/courses/design-lead/kick-off","date":"2019-09-05 16:00","endDate":null,"description":"En hyggelig og uformell introduksjon til årets program. Etter en presentasjon på ca. 1 time går vi videre til en lagøvelse før vi spiser middag sammen.","image":"/assets/knowit_academy_favicon_white.png","teacher":"TBA","updated":"2019-06-24","confirmed":null,"author":"Thea Basthus Nilsen","location":"Midten, Oslo"}}},{"node":{"html":"<p>Hva handler kommunikasjon egentlig om og hvordan kan vi bedre forstå hvordan\nvi mennesker prosesserer informasjon? Hva er det som gjør at kommunikasjon kan\nbli krevende eller enkel? Hvordan sikre at vi i et samspill med andre\nmennesker har en mest mulig effektiv kommunikasjon? I løpet av denne dagen\nskal vi dykke inn i forståelse av mentale prosesser og hvordan vi gjennom\ndette lettere kan skape en mer presis og felles forståelse.</p>\n<h1>Hva du lærer</h1>\n<p>I løpet av denne dagen vil du blant annet lære;</p>\n<ul>\n<li>Kommunikasjonsmodellen; en beskrivelse av hvordan vi mennesker behandler\ninformasjon og hvorfor vi skaper vår helt unike oppfatning.</li>\n<li>Hvorfor vi reagerer ulikt på samme informasjon og hvordan vi kan redusere\nsannsynligheten for at dette skjer</li>\n<li>Språkteknikker for å skape presisjon og felles forståelse</li>\n<li>Teknikker for hvordan være tilstede i øyeblikket for å skape en bedre flyt i\nkommunikasjonen</li>\n</ul>\n<h1>Om Alf Inge Cleve-Stiansen</h1>\n<p>Alf Inge har dedikert seg til å utforske, forstå og anvende strategier som\nkjennetegner de mennesker og organisasjoner som skaper enestående resultater.\nHan er en av Skandinavias fremste prestasjonsutviklere og har en genuin glede\nog interesse i å arbeide med utvikling av lederskapet, forandringsprosesser,\ndesign og utvikling av nye konsepter og bedriftsinterne programmer. Han har\nsolid og bred erfaring med å drive prestasjonsutvikling både på individnivå og\ni større grupper, og er ofte å se på større scener grunnet sine\nformidlingsevner. Alf Inge er en internasjonalt sertifisert NLP Trener, har en\nMastergrad i Strategy &#x26; International Business og en Krigsskoleutdannelse. Han\ner en av få som vitenskapelig har dokumentert sammenhengen mellom\nmedarbeider-engasjement, kunde-engasjement og økonomiske resultater det\nlederskapet, og har de siste årene designet og gjennomført programmer i\nsamskapning med kunder i ulike bransjer.</p>","frontmatter":{"title":"Kommunikasjon","path":"/courses/design-lead/kommunikasjon","date":"2019-11-19 09:00","endDate":null,"description":"Kurset går gjennom elementene i effektiv kommunikasjon, og hvordan vi bedre kan forstå hvordan vi mennesker prosesserer informasjon. I løpet av denne dagen skal vi dykke inn i forståelse av mentale prosesser og hvordan vi gjennom dette lettere kan skape en mer presis og felles forståelse.","image":"/assets/4BD5282F-4DE2-4374-8B3C-E7146A945CEF.jpeg","teacher":"Alf Inge Cleve-Stiansen","updated":"2019-08-09","confirmed":true,"author":"Michael Åhs","location":"Midten, Oslo"}}},{"node":{"html":"<h1>Stressmestring og psykologisk tryggghet</h1>\n<p>Kurset er todelt:</p>\n<h1>Stressmestring</h1>\n<p>Fokus vil være på å oppdage signaler og forstå hva som er positiv stress og hva som kan utvikle seg til en alvorlig sykdomstilstand. Vi er ikke tjent med at noen, ledere eller ansatte, \"går i veggen\" og trenger langvarig rekonvalesens. </p>\n<p>Overordnet tema for denne delen vil være hvordan best legge til rette for en bærekraftig hverdag, med hovedfokus på stress og stressmestring. Ila samlingen vil deltakerne få økt kunnskap om hva stress er og hvordan stress påvirker oss på kort og på lang sikt, økt kunnskap om vanlige stressreaksjoner, samt økt innsikt i virksomme stressmestringsteknikker. Samlingen vil bestå av teori og egenrefleksjon, og det legges opp til stor grad av dialog og interaksjon underveis.</p>\n<h1>Psykologisk trygghet</h1>\n<p>Høy psykologisk trygghet kjennetegnes ved at medarbeidere tør å stille spørsmål, si i fra om bekymringer, og har en opplevelse at feil ikke vil holdes mot dem.</p>\n<p>Teamlederen og mellomlederen er en nøkkelrolle. Psykologisk trygghet skjer på gruppenivå i organisasjonen. Derfor er det også her du må lete etter tegn på psykologisk trygghet, ikke på organisasjonsnivå.</p>\n<ul>\n<li>Psykologisk trygghet er ikke et mål – det er en effekt av optimalt team- og gruppemiljø. Målet er å levere best mulige resultater og prestasjoner.</li>\n<li>Psykologisk trygghet handler ikke om å være snill, men om å være åpen for innspill, konstruktiv kritikk og skape en ramme for læring.</li>\n</ul>\n<p>Deltakerne vil få innføring i grunnleggende psykologi, med særlig fokus på relasjonens betydning for godt samspill. Det vil også være fokus på hva som kjennetegner effektive team, og hvordan man som leder kan legge til rette for og bygge psykologisk trygghet i egne team, inkludert praktiske tips i hverdagen.</p>\n<h1>Om kursholder</h1>\n<p>Cecilie er organisasjonspsykolog og jobber både i offentlig og privat sektor med lederutvikling og -veiledning, team- og ledergruppeutvikling, arbeidsmiljøkartlegging og arbeidsmiljøtiltak, endring- og omstillingsprosesser, HR-rådgivning, stress og stressmestring samt generell foredragsvirksomhet. </p>\n<p>Hun er også gjesteforeleser for Executive MBA og Strategisk HRM ved UiS. Som kliniker tar hun imot bedriftskunder med avtale for behandling av lettere psykiske lidelser (angst, utbrenthet, stressmestring, sorgbearbeiding m.m.).</p>","frontmatter":{"title":"Stressmestring","path":"/courses/design-lead/stressmestring","date":"2019-12-02 16:00","endDate":null,"description":"Kurset er todelt og dekker både hvordan håndtere eget stressnivå og hvordan gi psykologisk trygghet til teamet.","image":"/assets/cecilie-byholt-endresen.jpg","teacher":"Cecilie Byholt Endresen","updated":"2019-06-24","confirmed":true,"author":"Jan Henrik Gundelsby","location":"Midten, Oslo"}}},{"node":{"html":"<p>Hva gjør de ulike designerne og hvilke behov har designere når de skal jobbe godt med utvikling og teknologi? Hvordan kan vi bygge opp og organisere velfungerende produkt- og tjenesteutviklingsteam?</p>\n<p>I workshoppen vil dere få en intro til de ulike designfeltene og metodikkene som brukes, i teori og praksis. Vi vil gå gjennom hvordan vi kan skape grunnlag for god samarbeidskultur, hvordan design og brukeropplevelse er sentralt i ethvert utviklingsteam og hvordan teknologi og utviklere bør involveres i designprosessen.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>Overordnet kunnskap om designprosess og metodikk</li>\n<li>Verktøy for samarbeid i produkt- og tjenesteutviklingsteam</li>\n<li>Designmetodikk for alle - praktiske øvelser hele teamet kan delta og bidra til - uavhengig av fagfelt </li>\n</ul>\n<h1>Om foredragsholder</h1>\n<p>Info kommer</p>","frontmatter":{"title":"Designmetodikk","path":"/courses/team-lead/designmetodikk","date":"2020-04-22","endDate":null,"description":"","image":null,"teacher":"Thea Basthus Nilsen","updated":"2019-06-24","confirmed":null,"author":"Jan Henrik Gundelsby","location":null}}},{"node":{"html":"<p>Verden endrer seg. Virksomheter blir digitale. Våre kunder og oss selv har\nbehov for å innovere, transformere og endre sine forretningsmodeller. Denne\nsesjonen er foredragsbasert, og har foredrag fra sentrale kunder av Knowit\nsamt akademia for å forstå mer om hvorfor og hvordan vi må endre oss for\nfremtidens marked.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>Tine Reuterdahl leder Origo:Digi (Oslo kommune) skal snakke om sin erfaring\nfra sin tid i oppstart av Finn.no, samt arbeid med Telia og nå i\nOrigo:Digi - Oslo kommunes organisasjon for digital transformasjon.</li>\n<li>Dr. Knut Rolland fra Universitetet i Oslo, Institutt for informatikk, kommer\nfor å snakke om de mer akademiske og teorietiske sidene av digital\ntransformasjon og innovasjon.</li>\n</ul>\n<h1>Om foredragsholderene</h1>\n<p><strong>Tine Reuterdahl</strong> Tine er leder av Origo Digi og har ansvaret for strategi\nog overordnet tilnærming til digitaliseringsprogrammet. Hun har bakgrunn fra\nflere produktselskaper, som Schibsted og Telia med digitalisering og\ninnovasjon.</p>\n<p><strong>Knut Rolland</strong> Associate Professor - Digitization and Entrepreneurship\nKnut’s research is positioned in the field of Information Systems (IS).\nCurrently, Knut’s research is concerned with digital platforms, digital\ntransformation, and agile development practices. Especially, his latest\nstudies have focused on how organizations can utilize digital platforms for\ntransforming their IT capabilities and improve their capacity to innovate.</p>","frontmatter":{"title":"Digital transformasjon og innovasjon","path":"/courses/team-lead/digital-transformasjon","date":"2020-06-04","endDate":null,"description":"","image":"","teacher":"TBD","updated":"2019-06-14","confirmed":null,"author":null,"location":null}}},{"node":{"html":"<h1>Estimering</h1>\n<p>Estimering er ofte nødvendig i IT-utvikling, og dette kurset gir deg faktaene\nbak estimering fra en av verdens ledende forskere på området, Magne Jørgensen.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>\n<p>Grunnleggende om estimering</p>\n<ul>\n<li>Hvorfor og når bommer vi på estimatene?</li>\n<li>Kundens bidrag til underestimering</li>\n<li>Vet du hva et estimat er?</li>\n<li>Kan du addere estimater?</li>\n</ul>\n</li>\n<li>Hvordan bør vi estimere og hva bør vi unngå?</li>\n<li>Usikkerhet i estimater</li>\n<li>Nytteestimering</li>\n</ul>\n<p>Men først, Magne gjør alltid en undersøkelse underveis i kurset...</p>\n<h1>Om foredragsholderen</h1>\n<p>Magne Jørgensen er professor ved Simula Research Laboratory, og er tilknyttet\nforskningsgruppen Globale Infrastrukturer ved Institutt for Informatikk ved\nUniversitetet i Oslo.</p>\n<p>Av tidsskriftet Journal of Systems and Software ble Jørgensen fire år på rad\nkåret til verdens mest produktive forsker innenfor systemutvikling: for\nperiodene 2001-2005, 2002-2006, 2003-2007 og 2004-2008.</p>\n<p>Hovedfokus for forskningen til Jørgensen er estimering av IT-prosjekter.</p>","frontmatter":{"title":"Estimering","path":"/courses/team-lead/estimering","date":"2020-03-24 16:00","endDate":null,"description":"Estimering er ofte nødvendig i IT-utvikling, og dette kurset gir deg faktaene bak estimering fra en av verdens ledende forskere på området, Magne Jørgensen.","image":"/assets/magne_jorgensen_prof_simula.jpg","teacher":"Magne Jørgensen","updated":"2019-08-06","confirmed":true,"author":null,"location":null}}},{"node":{"html":"<p>Profilering, automatisert behandling og persontilpassede tjenester er blitt en\ndel av vår hverdag. Dette medfører ofte behandling av personopplysninger i\nstor skala.</p>\n<p>Brukerne forventer at tjenester både er sikre og ivaretar personvernet på en\ngod måte. Virksomheter som tar personvern på alvor bygger tillit. Godt\npersonvern vil derfor ofte være et konkurransefortrinn.</p>\n<p>Innebygd personvern og personvern som standardinnstilling er et sentralt krav\ni personvernregelverket. I denne veilederen beskriver vi hvordan dette kravet\nkan ivaretas. Den behandlingsansvarlige skal følge kravet om innebygd\npersonvern ved utvikling av programvare, og ved bestilling av system,\nløsninger og tjenester. Kravet bør derfor også inkluderes når man inngår\navtaler med leverandører og ved bruk av konsulenter.</p>","frontmatter":{"title":"GDPR - programvareutvikling med innebygd personvern","path":"/courses/team-lead/gdpr","date":"2019-11-24","endDate":null,"description":null,"image":null,"teacher":"Torgeir Waterhouse","updated":"2019-06-19","confirmed":null,"author":"Thomas Malt","location":null}}},{"node":{"html":"<p>Kickoff'en har to hovedmålsetninger.</p>\n<ol>\n<li>Informere om og sette tydelige forventninger til årets program.</li>\n<li>La deltagerne bli bedre kjent gjennom teambuilding-aktivitet og tilhørende\nmiddag.</li>\n</ol>\n<h1>Hva du lærer</h1>\n<p>En presentasjon på ca. 1 time</p>\n<ul>\n<li>Informasjon om årets program, deltagere og arrangører. Runde rundt bordet.</li>\n<li>Forventninger til kursdeltagere</li>\n<li>Praktisk gjennomføring av programmet</li>\n<li>Eventuelle spørsmål</li>\n</ul>\n<p>Deretter kommer en hemmelig teambuildingsaktivitet og middag på byen for å bli\nbedre kjent.</p>\n<h1>Om foredragsholderen</h1>\n<p>Jan Henrik er CTO i Knowit Objectnet med 20 års erfaring som utvikler og\narkitekt i store prosjekter og programmer.</p>\n<p>Han er en av hovedarkitektene bak Oslo kommunes satsning på digitalt\nførstevalg, og han har vært sentral i å bygge en DevOps-kultur og\nmikrotjenestearkitektur. Jobber tett med forskningsmiljøer rundt autonome team\nog digitale plattformer. Er for tiden også rådgiver inn til Oslo:ORIGO.</p>\n<p>Han er også en av deltagerne i programkomiteen for Knowit Academy.</p>","frontmatter":{"title":"Kick-off og lagarbeid","path":"/courses/team-lead/kickoff","date":"2019-09-09 16:00","endDate":null,"description":"Hyggelig og uformell introduksjon til årets program. Etter en presentasjon på ca. 1 time går vi videre til en lagøvelse før vi spiser middag sammen.","image":"/assets/jan_henrik_gundelsby.jpg","teacher":"Jan Henrik Gundelsby","updated":"2019-06-19","confirmed":null,"author":"Thomas Malt","location":"Midten, Oslo"}}},{"node":{"html":"<p>Hva handler kommunikasjon egentlig om og hvordan kan vi bedre forstå hvordan\nvi mennesker prosesserer informasjon? Hva er det som gjør at kommunikasjon kan\nbli krevende eller enkel? Hvordan sikre at vi i et samspill med andre\nmennesker har en mest mulig effektiv kommunikasjon? I løpet av denne dagen\nskal vi dykke inn i forståelse av mentale prosesser og hvordan vi gjennom\ndette lettere kan skape en mer presis og felles forståelse.</p>\n<h1>Hva du lærer</h1>\n<p>I løpet av denne dagen vil du blant annet lære;</p>\n<ul>\n<li>Kommunikasjonsmodellen; en beskrivelse av hvordan vi mennesker behandler\ninformasjon og hvorfor vi skaper vår helt unike oppfatning.</li>\n<li>Hvorfor vi reagerer ulikt på samme informasjon og hvordan vi kan redusere\nsannsynligheten for at dette skjer</li>\n<li>Språkteknikker for å skape presisjon og felles forståelse</li>\n<li>Teknikker for hvordan være tilstede i øyeblikket for å skape en bedre flyt i\nkommunikasjonen</li>\n</ul>\n<h1>Om Alf Inge Cleve-Stiansen</h1>\n<p>Alf Inge har dedikert seg til å utforske, forstå og anvende strategier som\nkjennetegner de mennesker og organisasjoner som skaper enestående resultater.\nHan er en av Skandinavias fremste prestasjonsutviklere og har en genuin glede\nog interesse i å arbeide med utvikling av lederskapet, forandringsprosesser,\ndesign og utvikling av nye konsepter og bedriftsinterne programmer. Han har\nsolid og bred erfaring med å drive prestasjonsutvikling både på individnivå og\ni større grupper, og er ofte å se på større scener grunnet sine\nformidlingsevner. Alf Inge er en internasjonalt sertifisert NLP Trener, har en\nMastergrad i Strategy &#x26; International Business og en Krigsskoleutdannelse. Han\ner en av få som vitenskapelig har dokumentert sammenhengen mellom\nmedarbeider-engasjement, kunde-engasjement og økonomiske resultater det\nlederskapet, og har de siste årene designet og gjennomført programmer i\nsamskapning med kunder i ulike bransjer.</p>","frontmatter":{"title":"Kommunikasjon","path":"/courses/team-lead/kommunikasjon","date":"2019-09-25 09:00","endDate":null,"description":"Kurset går gjennom elementene i effektiv kommunikasjon, og hvordan vi bedre kan forstå hvordan vi mennesker prosesserer informasjon. I løpet av denne dagen skal vi dykke inn i forståelse av mentale prosesser og hvordan vi gjennom dette lettere kan skape en mer presis og felles forståelse.","image":"/assets/4BD5282F-4DE2-4374-8B3C-E7146A945CEF.jpeg","teacher":"Alf Inge Cleve-Stiansen","updated":"2019-06-24","confirmed":true,"author":"Michael Åhs","location":"Midten, Oslo"}}},{"node":{"html":"<p>Hvilke kontrakter bruker vi i Knowit? Når skal man bruke hvilken kontrakt type og hva er Statens Standardavtaler? </p>\n<p>I løpet av kvelden vil du blant annet få innsikt i:</p>\n<ul>\n<li>Hvilke kontrakter vi bruker i Knowit</li>\n<li>Hva er Statens Standardavtaler og hva er forskjellen på disse?</li>\n<li>Hvordan en gitt kontrakt vil påvirke prosjektet ditt i praksis. </li>\n</ul>\n<h1>Om foredragsholdere</h1>\n<p>Ragnhild er rådgiver i Inventura og er jurist med spesialisering innen offentlige anskaffelser</p>\n<p>Dag Thomas er partner i Inventura og har mer enn 20 års erfaring fra operativ gjennomføring av innkjøpsprosesser, herunder prosjektledelse, prosessledelse, forhandlingsledelse og -bistand, kostnadsstyring, kommersielle og offentlige innkjøpsprosesser.</p>","frontmatter":{"title":"Kontrakter","path":"/courses/team-lead/kontrakter","date":"2020-02-04 16:00","endDate":null,"description":"Hvilke kontrakter bruker vi i Knowit? Når skal man bruke hvilken kontrakt type og hva er Statens Standardavtaler?","image":"/assets/DagThomasRagnhild.jpg","teacher":"Inventura","updated":"2019-08-13","confirmed":true,"author":"Marit Hellestø","location":null}}},{"node":{"html":"<p>Hvordan presentere et budskap på en god og effektiv måte og samtidig få\ninnflytelse? Hvordan klare å omsette faglig innhold til lett forståelig\ninformasjon som skaper forståelse og engasjement? Målet med dette kurset er at\ndu som deltaker vil erfare mer mestring og skape sterkere innflytelse når du\nholder presentasjoner, ved at du har gode systemer og metoder som støtter deg\ni gjennomføringen. Dette er et kurs som fokuserer på deg som formidler og\nhvordan stå støtt i deg selv når du tar denne rollen. Om det er i et internt\nmøte, et møte ute hos kunden eller om du står på en større scene som en\nforedragsholder. Det er ikke et kurs i hvordan lage en\npowerpoint-presentasjon, men en dag der du blir bevisst deg selv på mange nye,\nspennende nivåer som gjør at du får gjennom budskap enda bedre enn du gjør i\ndag.</p>\n<h1>Hva du lærer</h1>\n<p>I løpet av denne dagen vil du blant annet lære;</p>\n<ul>\n<li>Hva kjennetegner de menneskene som best får gjennom sine budskap, og hvordan\ndu kan implementere dette i din kommunikasjon</li>\n<li>Hvilke nivåer du skaper utvikling i deg selv og gjennom det bli mer\nkraftfull i hvordan du formidler budskap</li>\n<li>Hvilke overbevisninger du bør ha for å fremstå trygg</li>\n<li>Hvilke spørsmål du bør guide deg selv etter for å sikre å få budskapet\ngjennom og skape best mulig læring</li>\n<li>Viktige elementer i en presentasjons-planlegging for å sikre at du lykkes</li>\n<li>Hvordan du kan styre egen tilstand for å ta bort nervøsitet og usikkerhet</li>\n</ul>\n<h1>About Alf Inge Cleve-Stiansen</h1>\n<p>Alf Inge har dedikert seg til å utforske, forstå og anvende strategier som\nkjennetegner de mennesker og organisasjoner som skaper enestående resultater.\nHan er en av Skandinavias fremste prestasjonsutviklere og har en genuin glede\nog interesse i å arbeide med utvikling av lederskapet, forandringsprosesser,\ndesign og utvikling av nye konsepter og bedriftsinterne programmer. Han har\nsolid og bred erfaring med å drive prestasjonsutvikling både på individnivå og\ni større grupper, og er ofte å se på større scener grunnet sine\nformidlingsevner. Alf Inge er en internasjonalt sertifisert NLP Trener, har en\nMastergrad i Strategy &#x26; International Business og en Krigsskoleutdannelse. Han\ner en av få som vitenskapelig har dokumentert sammenhengen mellom\nmedarbeider-engasjement, kunde-engasjement og økonimiske resultater det\nlederskapet, og har de siste årene designet og gjennomført programmer i\nsamskapning med kunder i ulike bransjer.</p>","frontmatter":{"title":"Presentasjonsteknikk","path":"/courses/team-lead/presentasjonsteknikk","date":"2020-01-21","endDate":null,"description":"","image":null,"teacher":"Alf Inge Cleve-Stiansen","updated":"2019-06-24","confirmed":null,"author":"Michael Åhs","location":null}}},{"node":{"html":"<h1>Om kurset</h1>\n<p>Vi skal skape en digital verden der alle føler seg trygge. Noen ganger er det imidlertid vanskelig å levere sikre systemer når alt skal skje raskere og sikkerhetskravene ikke prioriteres. Hvis en hendelse oppstår, kan sikkerhet det viktigste kravet.</p>\n<p>Som Team Lead er det viktig å:\nforstå behovet for balanse mellom sikkerhet og funksjonalitet og\nkunne diskutere med interessenter og team de sentrale sikkerhetsprinsippene.\nI tillegg til å vite hvilke sikkerhetsproblemer som bør prioriteres og hvordan man kan lede teamet for sikker systemutvikling.</p>\n<h1>Du vil lære</h1>\n<p>I denne sejsonen vil du blant annet lære:</p>\n<ul>\n<li>Nylige relevante hendelser som viser behovet for sikkerhet</li>\n<li>Betydningen av \"defence in depth\" kultur</li>\n<li>Sikkerhetsprinsipper og utfordringer</li>\n<li>Sikkerhetsmetoder og verktøy</li>\n</ul>\n<h1>Om foredragsholderen</h1>\n<p>Rickard Westberg har jobbet med utvikling av marine styringssystemer i 20 år i nesten alle roller fra utvikler til divisjonsleder. Rickard har lang erfaring med å jobbe innen sikkerhet i både system og infrastruktur. Rickard har de siste årene fokusert på muligheter og utfordringer ved digitalisering i sikkerhetskritiske applikasjoner.</p>","frontmatter":{"title":"Sikkerhet","path":"/courses/team-lead/sikkerhet","date":"2019-11-26","endDate":null,"description":"","image":"/assets/Rickard.jpg","teacher":"Rickard Westberg - Knowit Defence Technology","updated":"2019-07-05","confirmed":true,"author":"Michael Åhs","location":"Midten, Oslo"}}},{"node":{"html":"<h1>Stressmestring og psykologisk tryggghet</h1>\n<p>Kurset er todelt:</p>\n<h1>Stressmestring</h1>\n<p>Fokus vil være på å oppdage signaler og forstå hva som er positiv stress og hva som kan utvikle seg til en alvorlig sykdomstilstand. Vi er ikke tjent med at noen, ledere eller ansatte, \"går i veggen\" og trenger langvarig rekonvalesens. </p>\n<p>Overordnet tema for denne delen vil være hvordan best legge til rette for en bærekraftig hverdag, med hovedfokus på stress og stressmestring. Ila samlingen vil deltakerne få økt kunnskap om hva stress er og hvordan stress påvirker oss på kort og på lang sikt, økt kunnskap om vanlige stressreaksjoner, samt økt innsikt i virksomme stressmestringsteknikker. Samlingen vil bestå av teori og egenrefleksjon, og det legges opp til stor grad av dialog og interaksjon underveis.</p>\n<h1>Psykologisk trygghet</h1>\n<p>Høy psykologisk trygghet kjennetegnes ved at medarbeidere tør å stille spørsmål, si i fra om bekymringer, og har en opplevelse at feil ikke vil holdes mot dem.</p>\n<p>Teamlederen og mellomlederen er en nøkkelrolle. Psykologisk trygghet skjer på gruppenivå i organisasjonen. Derfor er det også her du må lete etter tegn på psykologisk trygghet, ikke på organisasjonsnivå.</p>\n<ul>\n<li>Psykologisk trygghet er ikke et mål – det er en effekt av optimalt team- og gruppemiljø. Målet er å levere best mulige resultater og prestasjoner.</li>\n<li>Psykologisk trygghet handler ikke om å være snill, men om å være åpen for innspill, konstruktiv kritikk og skape en ramme for læring.</li>\n</ul>\n<p>Deltakerne vil få innføring i grunnleggende psykologi, med særlig fokus på relasjonens betydning for godt samspill. Det vil også være fokus på hva som kjennetegner effektive team, og hvordan man som leder kan legge til rette for og bygge psykologisk trygghet i egne team, inkludert praktiske tips i hverdagen.</p>\n<h1>Om kursholder</h1>\n<p>Cecilie er organisasjonspsykolog og jobber både i offentlig og privat sektor med lederutvikling og -veiledning, team- og ledergruppeutvikling, arbeidsmiljøkartlegging og arbeidsmiljøtiltak, endring- og omstillingsprosesser, HR-rådgivning, stress og stressmestring samt generell foredragsvirksomhet. </p>\n<p>Hun er også gjesteforeleser for Executive MBA og Strategisk HRM ved UiS. Som kliniker tar hun imot bedriftskunder med avtale for behandling av lettere psykiske lidelser (angst, utbrenthet, stressmestring, sorgbearbeiding m.m.).</p>","frontmatter":{"title":"Stressmestring og psykologisk trygghet","path":"/courses/team-lead/stressmestring","date":"2019-10-31 16:00","endDate":null,"description":"Kurset er todelt og dekker både hvordan håndtere eget stressnivå og hvordan gi psykologisk trygghet til teamet.","image":"/assets/cecilie-byholt-endresen.jpg","teacher":"Cecilie Byholt Endresen","updated":"2019-06-24","confirmed":true,"author":"Jan Henrik Gundelsby","location":"Midten, Oslo"}}},{"node":{"html":"<p>This is a two day workshop on the Team-Lead role and technical leadership in\ngeneral. We will talk about the breadth of the Tech Lead role and why\ntechnical leadership like we aim to practice at Knowit is neccessary.</p>\n<h1>What you'll learn</h1>\n<p>During the 2-day workshop, we will aim to cover the following topics using a\ncombination of training techniques (presentation, discussions &#x26; interactive\nactivities):</p>\n<ul>\n<li>What the breadth of the Tech Lead role encompasses</li>\n<li>Why the Tech Lead role is necessary</li>\n<li>What makes the Tech Lead unique from other leadership roles</li>\n<li>What a Technical Vision is and how to shepherd a team towards a Technical\nVision</li>\n<li>Why Cross Functional Requirements matter</li>\n<li>How to identify and manage Cross Functional Requirements</li>\n<li>How to manage path to production tasks and resources</li>\n<li>How to manage technical risks</li>\n<li>Why relationships matter and how a Tech Lead builds and maintains good\nrelationships with technical and non-technical people</li>\n<li>Different influencing styles</li>\n<li>How to navigate conflict and find a way forward</li>\n</ul>","frontmatter":{"title":"Teknologiledelse","path":"/courses/team-lead/teknologiledelse","date":"2019-11-24 09:00","endDate":"2019-11-25 16:00","description":"This is a two day workshop on the Team-Lead role and technical leadership in general. We will talk about the breadth of the Tech Lead role and why technical leadership like we aim to practice at Knowit is neccessary.","image":"/assets/pat_kua.jpg","teacher":"Pat Kua","updated":"2019-08-02","confirmed":true,"author":"Jan Henrik Gundelsby","location":"Midten, Oslo"}}},{"node":{"html":"<p>Vi jobber ofte i tverrfaglige team når vi skal lage produkter eller løsninger.\nDet å få team til å fungere optimalt er helt essensielt for å få til effektiv\nsystemutvikling. Målet med dette kurset er å få innblikk i hva forskningen\nviser på området, og også kunne gi en del konkrete verktøy som kan brukes i\nhverdagen.</p>\n<p>Knowit har et forskningssamarbeid med SINTEF og flere andre samarbeidspartnere\npå autonome team. Derfor er vi så heldige å ha tilgang på de beste folka for å\nkunne fortelle oss om moderne måter å jobbe på!</p>\n<h1>Hva du lærer</h1>\n<p>I dette kurset er man innom en god del teknikker og måter å jobbe på i moderne\nsystemutvikling.</p>\n<ul>\n<li>Retrospectives</li>\n<li>Autonome team</li>\n<li>Aligned autonomy</li>\n<li>Scrum vs Kanban</li>\n<li>Koordinering i storskala smidig</li>\n<li>Møter og møtetips</li>\n<li>Sosiale nettverk</li>\n<li>BizDevOps</li>\n<li>Lean Startup</li>\n<li>Community Of Practice</li>\n</ul>\n<h1>Om foredragsholderene</h1>\n<p><strong>Nils Brede Moe</strong></p>\n<ul>\n<li>\n<p>Forskningsleder ved SINTEF Digital og forsker ved Blekinge Tekniske Høgskole\n(BTH)</p>\n<ul>\n<li>Autonome team, sourcing, innovasjon, agile praksiser, virtuelle team i mer\nenn 15 år</li>\n<li>Studier i Norden, Øst-Europa, USA, Kina og Australia</li>\n</ul>\n</li>\n</ul>\n<p><strong>Viktoria Stray</strong></p>\n<ul>\n<li>Main position: Associate professor, UiO</li>\n<li>\n<p>Part-time: Research Scientist, SINTEF Digital</p>\n<ul>\n<li>Research interests: Agile practices, teamwork, coordination, global\nsoftware development, large-scale agile, meetings, process improvement</li>\n</ul>\n</li>\n<li>Studies in Norway, Poland, China and Malaysia</li>\n<li>\n<p>Education:</p>\n<ul>\n<li>PhD in Software Engineering, UiO, 2014</li>\n<li>Computer Science, NTNU, 2007</li>\n</ul>\n</li>\n<li>\n<p>Work Experience:</p>\n<ul>\n<li>Accenture, 2007-2010</li>\n<li>Statoil</li>\n</ul>\n</li>\n</ul>","frontmatter":{"title":"Utviklingsprosesser","path":"/courses/team-lead/utviklingsprosesser","date":"2020-05-07","endDate":null,"description":"Vi jobber ofte i tverrfaglige team når vi skal lage produkter eller løsninger. Det å få team til å fungere optimalt er helt essensielt for å få til effektiv systemutvikling.","image":"/assets/viktoriaognils.jpg","teacher":"Viktoria Stray og Nils Brede Moe","updated":"2019-08-08","confirmed":null,"author":"Jan Henrik Gundelsby","location":null}}},{"node":{"html":"<p>Agile development is all about succeeding in our efforts with the help of\nshort, meaningful feedback loops. If we're not succeeding, then we ought to\nchange our practices. If we are succeeding, then we should not care what to\ncall it.</p>\n<p>The goal is not to be agile, but to succeed. With that thought in mind, what\nset of practices, when done correctly, can help us improve the chances of\nsuccess and lower the chances of failures? That's the question this course\nwill answer.</p>\n<p>This course takes a highly practical and result driven approach to being\nagile. It will present the major impediments, things we have to deeply\nintrospect and change. It will discuss why adaptive planning is highly\nessential and how to get the team to working in that mode. It has a good\nmixture of technical and non-technical details to help adapt, succeed and\nsustain agile development.</p>\n<h1>What you'll learn</h1>\n<ul>\n<li>Agile Development and Processes</li>\n<li>Adaptive planning</li>\n<li>Effective Estimation and planning</li>\n<li>Creating good User stories</li>\n<li>Practicing evolutionary design</li>\n<li>Automated testing for sustainable development</li>\n<li>Practices for successful agile teams</li>\n</ul>\n<h1>About Dr. Venkat Subramaniam</h1>\n<p>Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer,\nInc., and an instructional professor at the University of Houston. He has\nmentored tens of thousands of software developers in the US, Canada, Europe,\nand Asia, and is a regularly-invited speaker at several international\nconferences. Venkat helps his clients effectively apply and succeed with agile\npractices on their software projects.</p>\n<p>Venkat is a (co)author of multiple books, including the 2007 Jolt Productivity\naward winning book Practices of an Agile Developer. His latest book is\nTest-Driving JavaScript Applications: Rapid, Confident, Maintainable Code.\nVenkat is a well-recognized person in the software communities. He was once a\nrecipient of the MicroSoft MVP award. He has received JavaOne RockStar award\nthree years in a row and was inducted into the Java Champions program in 2013\nfor his efforts in motivating and inspiring software developers around the\nworld.</p>\n<p>Venkat has been in the training, consulting, and mentoring business\nsince 1996. He is recognized for his pragmatic approach, dislike for\naccidental complexity, continuous effort to seek minimalistic design, and\nsimpler solutions.</p>","frontmatter":{"title":"Agile Development Best Practices","path":"/courses/tech-lead/agile-development","date":"2019-10-07 09:00","endDate":"2019-10-08 16:00","description":"This course takes a highly practical and result driven approach to being agile. It will present the major impediments, things we have to deeply introspect and change. It will discuss why adaptive planning is highly essential and how to get the team to working in that mode. It has a good mixture of technical and non-technical details to help adapt, succeed and sustain agile development.","image":"/assets/venkat_subramaniam.jpg","teacher":"Dr. Venkat Subramaniam","updated":"2019-06-12","confirmed":true,"author":"Thomas Malt","location":"Midten, Oslo"}}},{"node":{"html":"<iframe width=\"720\" height=\"404\" \n  style=\"width: 100%; \n    height: 56.25vw; \n    padding-top: 24px;\"\n  src=\"https://www.youtube.com/embed/SKt1RfOmR3U\" frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen>\n</iframe>\n<p>This is an interactive two day workshop that helps you design and adopt\nmicroservices.</p>\n<p>There is lots of theory out there about microservice architecture, but how\noften do you get to put that knowledge into practice? It's not feasible to\nre-architect your real system often, and certainly not in a single day, or is\nit? This brand new workshop from the author of Building Microservices gives\nyou a safe space to explore ideas behind microservice architectures with peers\nfrom other organisations.</p>\n<p>In this workshop, we'll share some framing for micro service architectures\nthat explore the various forces that can drive the design and evolution of\nmicroservices, and then you'll participate in a series of interactive\narchitectural kata exercises to put your new found knowledge to the test.\nAfterwards, you'll have a series of tools to take back to your own\norganisations to put into practice.</p>\n<h1>What you'll learn</h1>\n<ul>\n<li>What makes a good microservice</li>\n<li>How to use concepts from domain driven design to define service boundaries</li>\n<li>Explore how to plan and manage a migration from a monolith to the\nmicroservice architecture</li>\n<li>Understand how technical choices can impact the architecture itself</li>\n<li>How to manage change and governance in a microservice environment</li>\n</ul>\n<h1>About Sam Newman</h1>\n<p>Sam Newman is an author, speaker, and independent consultant interested in\ncloud, continuous delivery and microservices. Aside from other things he has\nspoken at more than a few conferences, and wrote some things including the\nbooks <a href=\"http://buildingmicroservices.com/\">Building Microservices</a> and\n<a href=\"https://samnewman.io/books/monolith-to-microservices/\">Monolith To Microservices</a>\nfor O'Reilly.</p>\n<p>More about Sam Newman: <a href=\"https://samnewman.io/about/\">https://samnewman.io/about/</a></p>","frontmatter":{"title":"Building Microservices","path":"/courses/tech-lead/building-microservices","date":"2020-01-23 09:00","endDate":"2020-01-24 16:00","description":"This is an interactive two day workshop that helps you design and adopt microservices. We'll share some framing for micro service architectures that explore the various forces that can drive the design and evolution of microservices, and then you'll participate in a series of interactive architectural kata exercises to put your new found knowledge to the test.","image":"/assets/28F2166D-EA6E-492F-958F-BAF3B68691A1.jpeg","teacher":"Sam Newman","updated":"2019-06-19","confirmed":true,"author":"Thomas Malt","location":"Bergen"}}},{"node":{"html":"<p>Hva gjør de ulike designerne og hvilke behov har designere når de skal jobbe godt med utvikling og teknologi? Hvordan kan vi bygge opp og organisere velfungerende produkt- og tjenesteutviklingsteam?</p>\n<p>I workshoppen vil dere få en intro til de ulike designfeltene og metodikkene som brukes, i teori og praksis. Vi vil gå gjennom hvordan vi kan skape grunnlag for god samarbeidskultur, hvordan design og brukeropplevelse er sentralt i ethvert utviklingsteam og hvordan teknologi og utviklere bør involveres i designprosessen.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>Overordnet kunnskap om designprosess og metodikk</li>\n<li>Verktøy for samarbeid i produkt- og tjenesteutviklingsteam</li>\n<li>Designmetodikk for alle - praktiske øvelser hele teamet kan delta og bidra til - uavhengig av fagfelt </li>\n</ul>\n<h1>Om foredragsholder</h1>\n<p>Info kommer</p>","frontmatter":{"title":"Designmetodikk, prosess og roller","path":"/courses/tech-lead/designmetodikk","date":"2020-04-16","endDate":null,"description":null,"image":null,"teacher":"Thea Basthus Nilsen","updated":"2019-06-19","confirmed":null,"author":"Thomas Malt","location":null}}},{"node":{"html":"<h1>Estimering</h1>\n<p>Estimering er ofte nødvendig i IT-utvikling, og dette kurset gir deg faktaene\nbak estimering fra en av verdens ledende forskere på området, Magne Jørgensen.</p>\n<h1>Hva du lærer</h1>\n<ul>\n<li>\n<p>Grunnleggende om estimering</p>\n<ul>\n<li>Hvorfor og når bommer vi på estimatene?</li>\n<li>Kundens bidrag til underestimering</li>\n<li>Vet du hva et estimat er?</li>\n<li>Kan du addere estimater?</li>\n</ul>\n</li>\n<li>Hvordan bør vi estimere og hva bør vi unngå?</li>\n<li>Usikkerhet i estimater</li>\n<li>Nytteestimering</li>\n</ul>\n<p>Men først, Magne gjør alltid en undersøkelse underveis i kurset...</p>\n<h1>Om foredragsholderen</h1>\n<p>Magne Jørgensen er professor ved Simula Research Laboratory, og er tilknyttet\nforskningsgruppen Globale Infrastrukturer ved Institutt for Informatikk ved\nUniversitetet i Oslo.</p>\n<p>Av tidsskriftet Journal of Systems and Software ble Jørgensen fire år på rad\nkåret til verdens mest produktive forsker innenfor systemutvikling: for\nperiodene 2001-2005, 2002-2006, 2003-2007 og 2004-2008.</p>\n<p>Hovedfokus for forskningen til Jørgensen er estimering av IT-prosjekter.</p>","frontmatter":{"title":"Estimering","path":"/courses/tech-lead/estimering","date":"2020-03-24 16:00","endDate":null,"description":"Estimering er ofte nødvendig i IT-utvikling, og dette kurset gir deg faktaene bak estimering fra en av verdens ledende forskere på området, Magne Jørgensen.","image":"/assets/magne_jorgensen_prof_simula.jpg","teacher":"Magne Jørgensen","updated":"2019-06-19","confirmed":true,"author":"Jan Henrik Gundelsby","location":null}}},{"node":{"html":"<p>Profilering, automatisert behandling og persontilpassede tjenester er blitt en\ndel av vår hverdag. Dette medfører ofte behandling av personopplysninger i\nstor skala.</p>\n<p>Brukerne forventer at tjenester både er sikre og ivaretar personvernet på en\ngod måte. Virksomheter som tar personvern på alvor bygger tillit. Godt\npersonvern vil derfor ofte være et konkurransefortrinn.</p>\n<p>Innebygd personvern og personvern som standardinnstilling er et sentralt krav\ni personvernregelverket. I denne veilederen beskriver vi hvordan dette kravet\nkan ivaretas. Den behandlingsansvarlige skal følge kravet om innebygd\npersonvern ved utvikling av programvare, og ved bestilling av system,\nløsninger og tjenester. Kravet bør derfor også inkluderes når man inngår\navtaler med leverandører og ved bruk av konsulenter.</p>","frontmatter":{"title":"GDPR - programvareutvikling med innebygd personvern","path":"/courses/tech-lead/gdpr","date":"2019-11-04 16:00","endDate":null,"description":"En introduksjon til GDPR, hvorfor det er viktig, og hva det betyr for oss utviklere i praksis.","image":"/assets/torgeir_waterhouse.jpg","teacher":"Torgeir Waterhouse","updated":"2019-06-19","confirmed":true,"author":"Thomas Malt","location":null}}},{"node":{"html":"<p>En hyggelig og uformell introduksjon til årets program. Etter en presentasjon\npå ca. 1 time går vi videre til en lagøvelse før vi spiser middag sammen.</p>\n<p>Kickoff'en har to hovedmålsetninger.</p>\n<ol>\n<li>Informere om og sette tydelige forventninger til årets program.</li>\n<li>La deltagerne bli bedre kjent gjennom teambuilding-aktivitet og tilhørende\nmiddag.</li>\n</ol>\n<h1>Hva du lærer</h1>\n<p>En presentasjon på ca. 1 time</p>\n<ul>\n<li>Informasjon om årets program, deltagere og arrangører. Runde rundt bordet.</li>\n<li>Forventninger til kursdeltagere</li>\n<li>Praktisk gjennomføring av programmet</li>\n<li>Eventuelle spørsmål</li>\n</ul>\n<p>Deretter kommer en hemmelig teambuildingsaktivitet og middag på byen for å bli\nbedre kjent.</p>\n<h1>Om foredragsholderen</h1>\n<p>Jan Henrik er CTO i Knowit Objectnet med 20 års erfaring som utvikler og\narkitekt i store prosjekter og programmer.</p>\n<p>Han er en av hovedarkitektene bak Oslo kommunes satsning på digitalt\nførstevalg, og han har vært sentral i å bygge en DevOps-kultur og\nmikrotjenestearkitektur. Jobber tett med forskningsmiljøer rundt autonome team\nog digitale plattformer. Er for tiden også rådgiver inn til Oslo:ORIGO.</p>\n<p>Han er også en av deltagerne i programkomiteen for Knowit Academy.</p>","frontmatter":{"title":"Kick-off og lagarbeid","path":"/courses/tech-lead/kickoff","date":"2019-09-03 16:00","endDate":null,"description":"En hyggelig og uformell introduksjon til årets program. Etter en presentasjon på ca. 1 time går vi videre til en lagøvelse før vi spiser middag sammen.","image":"/assets/jan_henrik_gundelsby.jpg","teacher":"Jan Henrik Gundelsby","updated":"2019-08-14","confirmed":null,"author":"Thomas Malt","location":"Midten, Oslo"}}},{"node":{"html":"<p>Hva handler kommunikasjon egentlig om og hvordan kan vi bedre forstå hvordan\nvi mennesker prosesserer informasjon? Hva er det som gjør at kommunikasjon kan\nbli krevende eller enkel? Hvordan sikre at vi i et samspill med andre\nmennesker har en mest mulig effektiv kommunikasjon? I løpet av denne dagen\nskal vi dykke inn i forståelse av mentale prosesser og hvordan vi gjennom\ndette lettere kan skape en mer presis og felles forståelse.</p>\n<h1>Hva du lærer</h1>\n<p>I løpet av denne dagen vil du blant annet lære;</p>\n<ul>\n<li>Kommunikasjonsmodellen; en beskrivelse av hvordan vi mennesker behandler\ninformasjon og hvorfor vi skaper vår helt unike oppfatning.</li>\n<li>Hvorfor vi reagerer ulikt på samme informasjon og hvordan vi kan redusere\nsannsynligheten for at dette skjer</li>\n<li>Språkteknikker for å skape presisjon og felles forståelse</li>\n<li>Teknikker for hvordan våre tilstede i øyeblikket for å skape en bedre flyt i\nkommunikasjonen</li>\n</ul>\n<h1>About Alf Inge Cleve-Stiansen</h1>\n<p>Alf Inge har dedikert seg til å utforske, forstå og anvende strategier som\nkjennetegner de mennesker og organisasjoner som skaper enestående resultater.\nHan er en av Skandinavias fremste prestasjonsutviklere og har en genuin glede\nog interesse i å arbeide med utvikling av lederskapet, forandringsprosesser,\ndesign og utvikling av nye konsepter og bedriftsinterne programmer. Han har\nsolid og bred erfaring med å drive prestasjonsutvikling både på individnivå og\ni større grupper, og er ofte å se på større scener grunnet sine\nformidlingsevner. Alf Inge er en internasjonalt sertifisert NLP Trener, har en\nMastergrad i Strategy &#x26; International Business og en Krigsskoleutdannelse. Han\ner en av få som vitenskapelig har dokumentert sammenhengen mellom\nmedarbeider-engasjement, kunde-engasjement og økonimiske resultater det\nlederskapet, og har de siste årene designet og gjennomført programmer i\nsamskapning med kunder i ulike bransjer.</p>","frontmatter":{"title":"Kommunikasjon","path":"/courses/tech-lead/kommunikasjon","date":"2019-09-24 09:00","endDate":null,"description":"Kurset går gjennom elementene i effektiv kommunikasjon, og hvordan vi bedre kan forstå hvordan vi mennesker prosesserer informasjon. I løpet av denne dagen skal vi dykke inn i forståelse av mentale prosesser og hvordan vi gjennom dette lettere kan skape en mer presis og felles forståelse.","image":"/assets/4BD5282F-4DE2-4374-8B3C-E7146A945CEF.jpeg","teacher":"Alf Inge Cleve-Stiansen","updated":"2019-06-24","confirmed":true,"author":"Michael Åhs","location":"Midten, Oslo"}}},{"node":{"html":"<p>TBA</p>\n<h1>Hva du lærer</h1>\n<p>TBA</p>\n<h1>Om foredragsholder</h1>\n<p>Ina har lang erfaring som testleder, testansvarlig, testkoordinator og tester, og jobber med alle deler av testfaget og kvalitetetssikring av IT-løsninger. Hun har i tillegg arbeidet som prosjektleder, teknisk prosjektledelse og kravstiller i flere prosjekter innen forskjellige bransjer. Prosjektene har vært fra små og kortvarige leveranseprosjekter til delprosjekter i programmer som går over flere år. Ina jobber handson med test og liker å sette seg inn i nye verktøy og teknologier som vi bruker i test. Hun underviser i internasjonale sertifiseringskurs innen ISTQB.</p>","frontmatter":{"title":"Test og kvalitetssikring","path":"/courses/tech-lead/kvalitetssikring","date":"2020-02-06 16:00","endDate":null,"description":"Vi ønsker å oppnå høy kvalitet i alle prosjekter vi leverer. I en hverdag med hyppige releaser og et høyt fokus på devOps, hvordan holder man kvaliteten oppe?","image":"/assets/ina_espas.jpg","teacher":"Ina Espås","updated":"2019-06-19","confirmed":true,"author":"Marit Hellestø","location":null}}},{"node":{"html":"<p>Hvordan presentere et budskap på en god og effektiv måte og samtidig få\ninnflytelse? Hvordan klare å omsette faglig innhold til lett forståelig\ninformasjon som skaper forståelse og engasjement? Målet med dette kurset er at\ndu som deltaker vil erfare mer mestring og skape sterkere innflytelse når du\nholder presentasjoner, ved at du har gode systemer og metoder som støtter deg\ni gjennomføringen. Dette er et kurs som fokuserer på deg som formidler og\nhvordan stå støtt i deg selv når du tar denne rollen. Om det er i et internt\nmøte, et møte ute hos kunden eller om du står på en større scene som en\nforedragsholder. Det er ikke et kurs i hvordan lage en\npowerpoint-presentasjon, men en dag der du blir bevisst deg selv på mange nye,\nspennende nivåer som gjør at du får gjennom budskap enda bedre enn du gjør i\ndag.</p>\n<h1>Hva du lærer</h1>\n<p>I løpet av denne dagen vil du blant annet lære;</p>\n<ul>\n<li>Hva kjennetegner de menneskene som best får gjennom sine budskap, og hvordan\ndu kan implementere dette i din kommunikasjon</li>\n<li>Hvilke nivåer du skaper utvikling i deg selv og gjennom det bli mer\nkraftfull i hvordan du formidler budskap</li>\n<li>Hvilke overbevisninger du bør ha for å fremstå trygg</li>\n<li>Hvilke spørsmål du bør guide deg selv etter for å sikre å få budskapet\ngjennom og skape best mulig læring</li>\n<li>Viktige elementer i en presentasjons-planlegging for å sikre at du lykkes</li>\n<li>Hvordan du kan styre egen tilstand for å ta bort nervøsitet og usikkerhet</li>\n</ul>\n<h1>About Alf Inge Cleve-Stiansen</h1>\n<p>Alf Inge har dedikert seg til å utforske, forstå og anvende strategier som\nkjennetegner de mennesker og organisasjoner som skaper enestående resultater.\nHan er en av Skandinavias fremste prestasjonsutviklere og har en genuin glede\nog interesse i å arbeide med utvikling av lederskapet, forandringsprosesser,\ndesign og utvikling av nye konsepter og bedriftsinterne programmer. Han har\nsolid og bred erfaring med å drive prestasjonsutvikling både på individnivå og\ni større grupper, og er ofte å se på større scener grunnet sine\nformidlingsevner. Alf Inge er en internasjonalt sertifisert NLP Trener, har en\nMastergrad i Strategy &#x26; International Business og en Krigsskoleutdannelse. Han\ner en av få som vitenskapelig har dokumentert sammenhengen mellom\nmedarbeider-engasjement, kunde-engasjement og økonimiske resultater det\nlederskapet, og har de siste årene designet og gjennomført programmer i\nsamskapning med kunder i ulike bransjer.</p>","frontmatter":{"title":"Presentasjonsteknikk","path":"/courses/tech-lead/presentasjonsteknikk","date":"2020-03-03 09:00","endDate":null,"description":"Dette er et kurs som fokuserer på deg som formidler og hvordan stå støtt i deg selv når du tar denne rollen. Målet er at du som deltaker vil erfare mer mestring og skape sterkere innflytelse når du holder presentasjoner,","image":"/assets/4BD5282F-4DE2-4374-8B3C-E7146A945CEF.jpeg","teacher":"Alf Inge Cleve-Stiansen","updated":"2019-06-24","confirmed":true,"author":"Michael Åhs","location":"Midten, Oslo"}}},{"node":{"html":"","frontmatter":{"title":"Sikkerhet i utvikling","path":"/courses/tech-lead/sikkerhet-i-utvikling","date":"2020-06-01","endDate":null,"description":null,"image":null,"teacher":"TBD","updated":"2019-06-19","confirmed":null,"author":"Thomas Malt","location":null}}},{"node":{"html":"<p>The workshop is aimed at software developers and architects, and is a guide to\nmodern software architecture that's pragmatic rather than academic, and\nlightweight rather than \"enterprisey\".</p>\n<h1>What you'll learn</h1>\n<ul>\n<li>An introduction to what software architecture is.</li>\n<li>The importance of software architecture</li>\n<li>\n<p>Architectural drivers</p>\n<ul>\n<li>Requirements</li>\n<li>Quality attributes</li>\n<li>Constraints</li>\n<li>Principles</li>\n<li>Agility</li>\n</ul>\n</li>\n<li>\n<p>A definition of the software architecture role</p>\n<ul>\n<li>Technical leadership and the different leadership styles</li>\n<li>Technical skills</li>\n<li>Soft skills</li>\n<li>Software architecture and coding</li>\n</ul>\n</li>\n<li>\n<p>How to visualise software architecture</p>\n<ul>\n<li>Diagramming anti-patterns and typical problems</li>\n<li>The \"model-code gap\"</li>\n</ul>\n</li>\n<li>\n<p>C4 model core diagrams</p>\n<ul>\n<li>Abstractions and creating a shared vocabulary with a ubiquitous language</li>\n<li>An overview of the C4 model</li>\n<li>Notation and tips for better diagrams</li>\n<li>System Context diagrams</li>\n<li>Container diagrams</li>\n<li>Component diagrams</li>\n</ul>\n</li>\n<li>\n<p>C4 model - supplementary diagrams</p>\n<ul>\n<li>C4 and UML</li>\n<li>System Landscape diagrams</li>\n<li>Dynamic diagrams</li>\n<li>Deployment diagrams</li>\n</ul>\n</li>\n<li>\n<p>Documenting software architecture</p>\n<ul>\n<li>The importance of documentation</li>\n</ul>\n</li>\n<li>\n<p>Software architecture in the delivery process</p>\n<ul>\n<li>Quantifying and prioritising risk</li>\n<li>Identifying risk with risk-storming</li>\n<li>The conflict between architure and agile</li>\n<li>Approaching software architecture in a pragmatic, lightweight way</li>\n<li>How much up front design is enough?</li>\n</ul>\n</li>\n</ul>\n<h1>About Simon Brown</h1>\n<p>Simon is an independent consultant specializing in software architecture, and\nthe author of Software Architecture for Developers (a developer-friendly guide\nto software architecture, technical leadership and the balance with agility).</p>\n<p>He’s also the creator of the C4 software architecture model and the founder of\nStructurizr, which is a collection of open source and commercial tooling to\nhelp software teams visualise, document and explore their software\narchitecture.</p>","frontmatter":{"title":"Software Architecture for Developers","path":"/courses/tech-lead/software-architecture","date":"2019-11-13 09:00","endDate":"2019-11-14 16:00","description":"The workshop is aimed at software developers and architects, and is a guide to modern software architecture that's pragmatic rather than academic, and lightweight rather than 'enterprisey'.","image":"/assets/simon_brown.jpg","teacher":"Simon Brown","updated":"2019-06-24","confirmed":true,"author":"Thomas Malt","location":"Midten, Oslo"}}},{"node":{"html":"<p>Members of the SRE team explain how their engagement with the entire software\nlifecycle has enabled Google to build, deploy, monitor, and maintain some of\nthe largest software systems in the world.</p>\n<p><a href=\"https://landing.google.com/sre/books/\">Link to the books</a></p>\n<h1>What you'll learn</h1>\n<p>The Site Reliability Workbook is the hands-on companion to the bestselling\nSite Reliability Engineering book and uses concrete examples to show how to\nput SRE principles and practices to work. This book contains practical\nexamples from Google’s experiences and case studies from Google’s Cloud\nPlatform customers. Evernote, The Home Depot, The New York Times, and other\ncompanies outline hard-won experiences of what worked for them and what\ndidn’t.</p>","frontmatter":{"title":"Site Reliability Engineering","path":"/courses/tech-lead/site-reliability-engineering","date":"2020-05-26","endDate":null,"description":"Members of the SRE team explain how their engagement with the entire software lifecycle has enabled Google to build, deploy, monitor, and maintain some of the largest software systems in the world.","image":null,"teacher":"TBD","updated":"2019-06-19","confirmed":null,"author":"Thomas Malt","location":null}}},{"node":{"html":"<p>Vi jobber ofte i tverrfaglige team når vi skal lage produkter eller løsninger.\nDet å få team til å fungere optimalt er helt essensielt for å få til effektiv\nsystemutvikling. Målet med dette kurset er å få innblikk i hva forskningen\nviser på området, og også kunne gi en del konkrete verktøy som kan brukes i\nhverdagen.</p>\n<p>Knowit har et forskningssamarbeid med SINTEF og flere andre samarbeidspartnere\npå autonome team. Derfor er vi så heldige å ha tilgang på de beste folka for å\nkunne fortelle oss om moderne måter å jobbe på!</p>\n<h1>Hva du lærer</h1>\n<p>I dette kurset er man innom en god del teknikker og måter å jobbe på i moderne\nsystemutvikling.</p>\n<ul>\n<li>Retrospectives</li>\n<li>Autonome team</li>\n<li>Aligned autonomy</li>\n<li>Scrum vs Kanban</li>\n<li>Koordinering i storskala smidig</li>\n<li>Møter og møtetips</li>\n<li>Sosiale nettverk</li>\n<li>BizDevOps</li>\n<li>Lean Startup</li>\n<li>Community Of Practice</li>\n</ul>\n<h1>Om foredragsholderene</h1>\n<p><strong>Nils Brede Moe</strong></p>\n<ul>\n<li>\n<p>Forskningsleder ved SINTEF Digital og forsker ved Blekinge Tekniske Høgskole\n(BTH)</p>\n<ul>\n<li>Autonome team, sourcing, innovasjon, agile praksiser, virtuelle team i mer\nenn 15 år</li>\n<li>Studier i Norden, Øst-Europa, USA, Kina og Australia</li>\n</ul>\n</li>\n</ul>\n<p><strong>Viktoria Stray</strong></p>\n<ul>\n<li>Main position: Associate professor, UiO</li>\n<li>\n<p>Part-time: Research Scientist, SINTEF Digital</p>\n<ul>\n<li>Research interests: Agile practices, teamwork, coordination, global\nsoftware development, large-scale agile, meetings, process improvement</li>\n</ul>\n</li>\n<li>Studies in Norway, Poland, China and Malaysia</li>\n<li>\n<p>Education:</p>\n<ul>\n<li>PhD in Software Engineering, UiO, 2014</li>\n<li>Computer Science, NTNU, 2007</li>\n</ul>\n</li>\n<li>\n<p>Work Experience:</p>\n<ul>\n<li>Accenture, 2007-2010</li>\n<li>Statoil</li>\n</ul>\n</li>\n</ul>","frontmatter":{"title":"Utviklingsprosesser","path":"/courses/tech-lead/utviklingsprosesser","date":"2020-05-06","endDate":null,"description":"Vi jobber ofte i tverrfaglige team når vi skal lage produkter eller løsninger. Det å få team til å fungere optimalt er helt essensielt for å få til effektiv systemutvikling.","image":"/assets/viktoriaognils.jpg","teacher":"Viktoria Stray og Nils Brede Moe","updated":"2019-08-08","confirmed":null,"author":"Jan Henrik Gundelsby","location":null}}}]}}}