{"data":{"site":{"siteMetadata":{"title":"Knowit Academy Norway","siteUrl":"https://academy.knowit.no/","description":"Knowit Academy Norway er Knowits kompetanseutviklingsprogram for ansatte i alle norske enheter. Planleggingen av programmet for 2019-2020 er i gang, og mer informasjon vil bli lagt ut så snart det er klart.","ogImage":"https://academy.knowit.no/assets/knowit_academy_banner_green.png"}},"allMarkdownRemark":{"edges":[{"node":{"html":"<h1>Tech-lead programmet</h1>\n<p>Tech-lead programmet er for deg med 2-5 års utviklererfaring og oppover, som ønsker å lede og ta arkitektur- og teknologiansvar.</p>\n<h2>Påmelding</h2>\n<p>Informasjon om påmelding og frister kommer snart.\nHer kommer tekst jeg skal fjerne.</p>\n<h2>Mer informasjon</h2>\n<p>Her kommer mer informasjon om årets program så snart det er klart.</p>","frontmatter":{"title":"Tech-lead programmet","path":"/programs/tech-lead","date":"2019-04-27","description":"For deg med 2-5 års utviklererfaring, som vil utvikle deg videre som tech-lead og arkitekt på et utviklingsteam."}}},{"node":{"html":"<h1>Team-lead programmet</h1>\n<p>Her kommer informasjon om årets program</p>\n<h2>Påmelding</h2>\n<p>Informasjon om påmelding og frister kommer snart.</p>\n<h2>Mer informasjon</h2>\n<p>Her kommer mer informasjon om årets program så snart det er klart.</p>","frontmatter":{"title":"Team-lead programmet","path":"/programs/team-lead","date":"2019-04-27","description":"For deg med minst 5 års utviklererfaring, og som ønsker å ta en faglig lederrolle, samt utvikle og følge opp et teknisk team."}}},{"node":{"html":"<h1>Design-lead programmet</h1>\n<p>Legg til mer innhold her.</p>\n<h2>Påmelding</h2>\n<p>Påmelding til programmene åpner i midten av august, og fristen for påmelding blir 31. august, 2019.</p>\n<h2>Mer informasjon</h2>\n<p>Her kommer mer informasjon om årets program så snart det er klart.</p>","frontmatter":{"title":"Design-lead programmet","path":"/programs/design-lead","date":"2019-06-05","description":"For deg med 2-5 års erfaring med tjenestedesign, visuell design eller interaksjonsdesign, og som vil utvikle deg videre for å ta større ansvar i leveranser, strategiarbeid og ledelse."}}},{"node":{"html":"<h1>Agile Development Best Practices</h1>\n<h1>Hva du lærer</h1>\n<h1>Om foredragsholderen</h1>\n<p>Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston. He has mentored tens of thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.</p>\n<p>Venkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Test-Driving JavaScript Applications: Rapid, Confident, Maintainable Code. Venkat is a well-recognized person in the software communities. He was once a recipient of the MicroSoft MVP award. He has received JavaOne RockStar award three years in a row and was inducted into the Java Champions program in 2013 for his efforts in motivating and inspiring software developers around the world.</p>\n<p>Venkat has been in the training, consulting, and mentoring business since 1996. He is recognized for his pragmatic approach, dislike for accidental complexity, continuous effort to seek minimalistic design, and simpler solutions.</p>","frontmatter":{"title":"Agile Development Best Practices med Venkat Subramaniam","path":"/courses/tech-lead/agile-development","date":"2019-06-05","description":""}}},{"node":{"html":"<p>Knowit Academy Norway er Knowits interne kompetanseutviklingsprogram.\nMålgruppen for programmet er alle ansatte i Knowits selskaper i Norge. Vår\nambisjon er å lage det beste og mest givende kompetanseutviklingsprogramet man kan finne i teknologibedrfter.</p>\n<p>Med oppstart høsten 2019 planlegger vi å gjennomføre programmer for tech-leads, team-leads og designere.</p>\n<p>Vi har også et program for prosjektledere vi jobber med å gjennomføre med oppstart høsten 2020.</p>","frontmatter":{"title":"About Knowit Academy","path":"/about","date":"2019-06-05","description":"Knowit Academy er knowits interne utviklingsprogram. Programmet har som ambisjon om å være det beste og mest givende kompentaseutviklingsprogrammet."}}},{"node":{"html":"<h1>Informasjon om søknadsprosessen</h1>\n<p>Det er mange som vil delta på programmene i Knowit Academy og stor konkurranse om plassene.\nHer kommer mer informasjon om søknadsprosessen og hvordan du går fram for å søke.</p>\n<h2>Avklar med nærmeste leder</h2>\n<p>Avklar med din nærmeste leder at du ønsker å søke på programmet. Hun eller han vil også kunne fortelle deg mer om søknadsprosessen.</p>\n<h2>Skriv et søknadsbrev</h2>\n<p>Vi ønsker skriftlige søknader fra alle som ønsker å delta. Fortell oss hvem du er, hvorfor du ønsker å søke og hva du håper å benytte det du lærer til.</p>\n<h2>Send inn søknad</h2>\n<p>Husk å sende inn søknad innen fristen.\nFristen i år vil være <b>31. august</b></p>\n<p>Mer informasjon om søknadsfrist kommer i begynnelsen av august.</p>","frontmatter":{"title":"Informasjon om søknadsprosessern til Knowit Academy","path":"/how-to-apply","date":"2019-06-05","description":"Information in Norwegian about the application process for Knowit Academy"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}